#!/usr/bin/env python
# -*- coding: utf-8 -*-

#########################################################################
# File Name: cache/dictcache.py
# Author: tangming
# mail: 707167666@qq.com
# Created Time: 2015-11-18 09:56
#########################################################################


''' 文件字典
    用於一个服务需要多次请求的问题
    例如福利,系统存储多份(逗号分隔),需要取其与第三方的对照字典

'''


RD2Welfare = {
    '401000': {'id': '10000', 'name': u'五险一金'},
    '401001': {'id': '10001', 'name': u'年底双薪'},
    '401002': {'id': '10002', 'name': u'绩效奖金'},
    '401003': {'id': '10003', 'name': u'年终分红'},
    '401004': {'id': '10004', 'name': u'股票期权'},
    '401005': {'id': '10005', 'name': u'加班补助'},
    '401006': {'id': '10006', 'name': u'全勤奖'},
    '401007': {'id': '10007', 'name': u'包吃'},
    '401008': {'id': '10008', 'name': u'包住'},
    '401009': {'id': '10009', 'name': u'交通补助'},
    '401010': {'id': '10010', 'name': u'餐补'},
    '401011': {'id': '10011', 'name': u'房补'},
    '401012': {'id': '10012', 'name': u'通讯补贴'},
    '401013': {'id': '10013', 'name': u'采暖补贴'},
    '401014': {'id': '10014', 'name': u'带薪年假'},
    '401015': {'id': '10015', 'name': u'弹性工作'},
    '401016': {'id': '10016', 'name': u'补充医疗保险'},
    '401017': {'id': '10017', 'name': u'定期体检'},
    '401018': {'id': '10018', 'name': u'免费班车'},
    '401019': {'id': '10019', 'name': u'员工旅游'},
    '401020': {'id': '10020', 'name': u'高温补贴'},
    '401021': {'id': '10021', 'name': u'节日福利'}
}


WYWelfare = {
    '401000': {'name': u'五险一金'},
    '401016': {'name': u'补充医疗保险'},
    '401022': {'name': u'补充公积金'},
    '401018': {'name': u'免费班车'},
    '401019': {'name': u'员工旅游'},
    '401009': {'name': u'交通补贴'},
    '401010': {'name': u'餐饮补贴'},
    '401012': {'name': u'通讯补贴'},
    '401023': {'name': u'专业培训'},
    '401024': {'name': u'出国机会'},
    '401002': {'name': u'绩效奖金'},
    '401003': {'name': u'年终奖金'},
    '401004': {'name': u'股票期权'},
    '401015': {'name': u'弹性工作'},
    '401017': {'name': u'定期体检'},
    # 自定义福利标签
    '401001': {'name': u'年底双薪'},
    '401005': {'name': u'加班补助'},
    '401006': {'name': u'全勤奖'},
    '401007': {'name': u'包吃'},
    '401008': {'name': u'包住'},
    '401011': {'name': u'房补'},
    '401013': {'name': u'采暖补贴'},
    '401014': {'name': u'带薪年假'},
    '401016': {'name': u'补充医疗保险'},
    '401020': {'name': u'高温补贴'},
    '401021': {'name': u'节日福利'}
}
